// getRandomFruit.js
const banglaFruits = [
  "আম", "কাঁঠাল", "কলা", "লিচু", "পেঁপে", "আনারস", "তরমুজ", "জাম", "সফেদা", "ডালিম",
  "কামরাঙ্গা", "চালতা", "পেয়ারা", "কুল", "আমড়া", "বেল", "চালমুগরি", "অড়বড়ই", "ডেউয়া", "চালতা",
  "হরীতকী", "বহেরা", "তেঁতুল", "খেজুর", "নারিকেল", "সুপারি", "আতা", "শরিফা", "ত্বিন", "জামরুল",
  "রাম্বুটান", "ড্রাগন ফল", "তিসি ফল", "বাদাম", "কিসমিস", "খারাজ", "চেরি", "স্ট্রবেরি", "ব্ল্যাকবেরি", "ব্লুবেরি",
  "কিউই", "মাল্টা", "লেবু", "বাতাবি লেবু", "মৌসুমি", "কমলা", "বরই", "সফেদা", "ডুমুর", "সজনে ফল",
  "হুগলা", "পেঁচা ফল", "মালবেরি", "করমচা", "হুগলি", "আমলকি", "রক্তজাম", "পাতালকচু ফল", "লটকন", "হরিতকি",
  "কাঁঠালের বিচি", "খিরনি", "ডালিম", "পানিফল", "বাঙ্গি", "বেদানা", "গাব", "চাম্পা", "কাঠবাদাম", "মিষ্টি তেঁতুল",
  "পাথর ফল", "পাকুড়", "পেঁয়াজ ফুল", "পিঁপড়া ফল", "মহুয়া", "গঙ্গাফল", "তুরমুজ", "কাঁচা বাদাম", "আলুবোখারা", "কাঠালিচাপা",
  "পেঁচি", "পুদিনা ফল", "তিল ফল", "সুগন্ধি লেবু", "মালা ফল", "চম্পা কলা", "মিষ্টি কুল", "হরিনার ফল", "গুইসাপ ফল", "দুধ ফল",
  "খেজুর খাওয়া", "কলা গাছের ফুল", "হিমসাগর আম", "মধু ফল", "পাথর লেবু", "চিতা ফল", "টক আম", "সাদা জাম", "জাফরানি আম", "নারকেল গাছের ফল"
];


function getRandomFruit() {
  const i = Math.floor(Math.random() * banglaFruits.length);
  return banglaFruits[i];
}

module.exports = getRandomFruit;
